tap "codecrafters-io/tap"
tap "homebrew/cask-fonts"

brew "mas"
brew "neovim"
brew "nvm"
brew "pngpaste"
brew "zig"
brew "codecrafters-io/tap/codecrafters"

cask "font-hack-nerd-font"
cask "font-noto-sans-cjk-kr"
cask "dbeaver-community"
cask "figma"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "obsidian"
cask "orbstack"
cask "rectangle"
cask "slack"
cask "visual-studio-code"

mas "AdGuard for Safari", id: 1440147259
mas "KakaoTalk", id: 869223134
mas "Xcode", id: 497799835

brew "imagemagick"
brew "zsh-fast-syntax-highlighting"
brew "zsh-autosuggestions"
brew "oh-my-zsh"
brew "zoxide"
brew "lazygit"
brew "bottom"
brew "yazi"
brew "nixfmt-rfc-style"
brew "delta"
brew "bat"
brew "direnv"
brew "fzf"
brew "terraform"
brew "awscli2"
brew "ripgrep"
brew "wget"
brew "gnupg"
brew "ddgr"
brew "gh"

