romkatv/powerlevel10k path:powerlevel10k.zsh-theme

jeffreytse/zsh-vi-mode

zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

ohmyzsh/ohmyzsh path:plugins/zoxide

mafredri/zsh-async
